app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
    def show
        # Show action is running a databas query on the Post model
        # That will return a post with an ID that matches the route params
        @post = Post.find(params[:id])